In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
data = [[10,20,78],[30,40,67],[50,60,56],[70,80,34]] # 리스트의 리스트
df = pd.DataFrame(data, columns=['kor','eng','math'],
                 index=['aa','bb','cc','dd'])
df

    kor  eng  math
aa   10   20    78
bb   30   40    67
cc   50   60    56
dd   70   80    34

### rename 함수
Pandas Documents
( https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.rename.html )

In [8]:
df.rename(columns={'kor':'국어','eng':'영어'},inplace = True)
df

    국어  영어  math
aa  10  20    78
bb  30  40    67
cc  50  60    56
dd  70  80    34

In [11]:
df.rename(index={'aa':'홍길동','bb':'김철수'},inplace=True)
df

     국어  영어  math
홍길동  10  20    78
김철수  30  40    67
cc   50  60    56
dd   70  80    34

### reset_index 함수
기존의 index가 하나의 컬럼으로 들어가고, 0부터 시작하는 새로운 index가 부여된다

In [12]:
df.reset_index()

  index  국어  영어  math
0   홍길동  10  20    78
1   김철수  30  40    67
2    cc  50  60    56
3    dd  70  80    34

### set_index 함수
해당 컬럼을 index로 만들어버린다

In [14]:
df.set_index('math')

      국어  영어
math
78    10  20
67    30  40
56    50  60
34    70  80